tap "homebrew/cask"
tap "cantino/mcfly"
tap "clementtsang/bottom"

cask_args appdir: "/Applications"

# Text Editor
brew "neovim"

# k8s/docker
cask "docker"
brew "kubectl"
brew "helm"
brew "kind"

# Modern Unix Commands
brew "ag"
brew "fd"
brew "fzf"
brew "jq"
brew "mcfly"
brew "ripgrep"
brew "choose"
brew "sd"
brew "cheat"
brew "tldr"
brew "bottom"
brew "glances"
brew "hyperfine"
brew "gping"
brew "procs"
brew "dog"
brew "duf"
brew "dust"
brew "broot"
brew "delta"
brew "lsd"
brew "exa"
brew "bat"

# Runtime
brew "node"
brew "nvm"
brew "go"
brew "rust"
brew "rustup-init"
brew "llvm"
cask "miniconda"
brew "gradle"
brew "openjdk@11"
brew "google-java-format"

# Others
brew "mas"
brew "peco"
brew "ghq"

# GUI 
cask "alfred"
cask "firefox"
cask "iterm2"
cask "karabiner-elements"

# Mas
mas "Slack", id: 803453959

