tap "homebrew/cask"
tap "homebrew/core"
tap "cantino/mcfly"
tap "clementtsang/bottom"

cask_args appdir: "/Applications"

# Text Editor
brew "neovim"
cask "visual-studio-code"

# k8s/docker
cask "docker"
brew "kubectl"
brew "helm"
brew "kind"
brew "kustomize"

# Cloud
cask "google-cloud-sdk"
brew "awscli"
brew "oci-cli"

# Modern Unix Commands
brew "ag"
brew "fd"
brew "fzf"
brew "jq"
brew "mcfly"
brew "ripgrep"
brew "choose"
brew "sd"
brew "cheat"
brew "tldr"
brew "bottom"
brew "glances"
brew "hyperfine"
brew "gping"
brew "procs"
brew "dog"
brew "duf"
brew "dust"
brew "broot"
brew "delta"
brew "lsd"
brew "exa"
brew "bat"
brew "wget"

# Runtime
brew "node"
brew "yarn"
brew "nvm"
brew "go"
brew "rust"
brew "rustup-init"
brew "llvm"
cask "miniconda"
brew "gradle"
brew "openjdk@11"
cask "adoptopenjdk"
brew "google-java-format"
brew "pipenv"
brew "poetry"
brew "haskell-stack"

# IaC Tool
brew "terraform"
brew "terraform-ls"
brew "tflint"

# Virtual Machine
cask "utm"

# Others
brew "mas"
brew "peco"
brew "ghq"
cask "google-japanese-ime"
brew "tree"
cask "discord"
brew "coreutils"
brew "zsh-completions"

# GUI 
cask "alfred"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "skitch"
cask "zoom"
cask "xmind"
cask "microsoft-teams"
cask "brave-browser"
cask "miro"
cask "android-studio"
cask "deepl"

# Mas
mas "Slack", id: 803453959
mas "Kindle", id: 405399194
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "LINE", id: 539883307
mas "PhotoScape X - Photo Editor", id: 929507092
mas "Xcode", id: 497799835

